### Pandas performs advanced operations on tabular data

# Importing Pandas package

In [2]:
import pandas as pd

# Create a DataFrame by importing a csv file

In [3]:
# Import the cars.csv
cars = pd.read_csv("./cars.csv")

# Print out cars
print(cars)

   Sr_No Country_Code  Cars        Country  Drives_Right
0      1           US   809  United States          True
1      2          AUS   731      Australia         False
2      3           IN   100          India         False
3      4          JAP   588          Japan         False
4      5           RU   200         Russia          True
5      6           EG    45          Egypt          True

# Finding rows and columns for a DataFrame

In [4]:
cars.shape

(6, 5)

# Reading data from column

In [5]:
cars["Country_Code"]

0     US
1    AUS
2     IN
3    JAP
4     RU
5     EG
Name: Country_Code, dtype: object

# Reading data from row

In [6]:
cars.iloc[0:3, :]

   Sr_No Country_Code  Cars        Country  Drives_Right
0      1           US   809  United States          True
1      2          AUS   731      Australia         False
2      3           IN   100          India         False

# Getting top few rows

In [7]:
cars.head()

   Sr_No Country_Code  Cars        Country  Drives_Right
0      1           US   809  United States          True
1      2          AUS   731      Australia         False
2      3           IN   100          India         False
3      4          JAP   588          Japan         False
4      5           RU   200         Russia          True

In [8]:
cars.head(3)

   Sr_No Country_Code  Cars        Country  Drives_Right
0      1           US   809  United States          True
1      2          AUS   731      Australia         False
2      3           IN   100          India         False

# Getting bottom few rows

In [9]:
cars.tail()

   Sr_No Country_Code  Cars    Country  Drives_Right
1      2          AUS   731  Australia         False
2      3           IN   100      India         False
3      4          JAP   588      Japan         False
4      5           RU   200     Russia          True
5      6           EG    45      Egypt          True

In [10]:
cars.tail(2)

   Sr_No Country_Code  Cars Country  Drives_Right
4      5           RU   200  Russia          True
5      6           EG    45   Egypt          True

# Deleting column from table

In [11]:
cars.drop("Country_Code", axis=1)     # axis = 1 means referring to columns

   Sr_No  Cars        Country  Drives_Right
0      1   809  United States          True
1      2   731      Australia         False
2      3   100          India         False
3      4   588          Japan         False
4      5   200         Russia          True
5      6    45          Egypt          True

# Deleting row from table

In [12]:
cars.drop([1], axis=0)     # axis = 0 means referring to rows

   Sr_No Country_Code  Cars        Country  Drives_Right
0      1           US   809  United States          True
2      3           IN   100          India         False
3      4          JAP   588          Japan         False
4      5           RU   200         Russia          True
5      6           EG    45          Egypt          True